/*
 * Created by Qt Creator 4.11.0 @ 27 Mar 2021 23:37:11
 *
 * Project: GB_CppOOP
 * File: hand.cpp
 *
 * Author: Sergey Lola
 */
#include "hand.h"

#include "card.h"

// --------------------------------------------------------------------------------------
Hand::Hand() {
  // резервируем максимально возможное число в колоде
  m_cards.reserve(7u);
}

// --------------------------------------------------------------------------------------
Hand::~Hand() {}

// --------------------------------------------------------------------------------------
void Hand::add(Hand::PtrCard p_card) {
  m_cards.push_back(p_card);
}

// --------------------------------------------------------------------------------------
void Hand::clear() {
  // "умный" указатель выполнит очистку без каких либо дополнительный действий
  m_cards.clear();
}

// --------------------------------------------------------------------------------------
int Hand::getValue() const {
  // если карт в руке нет или первая карта лежит "рубашкой" вверх, возвращаем 0
  if (m_cards.empty() || 0 == m_cards.front()->getValue()) {
    return 0;
  }

  bool containsAce{false};
  int score{0};
  for (auto it = m_cards.cbegin(); it != m_cards.cend(); ++it) {
    score += (*it)->getValue();
    if (static_cast<CardValue>((*it)->getValue()) == CardValue::Ace) {
      containsAce = true;
    }
  }

  // если в руке есть хотя бы один туз и общая сумма не превышает 11 очков
  // включительно, то туз дает не 1, а 11 очков
  if (containsAce && score <= 11) {
    score += 10;
  }

  return score;
}

// --------------------------------------------------------------------------------------

